tests/fixtures/webhooks/billing_statement.voided.json

{
    "id": "evt_oV6zyW9qbrDHQprpbXYcUbrVT9qdikM4",
    "resource": "event",
    "type": "billing_statement.voided",
    "data": {
        "id": "bstm_nLFsNS1Yxhm2BMABpXQgqC7Qh3Uv4cGU",
        "resource": "billing_statement",
        "amount": 50000,
        "currency": "PHP",
        "customer_id": "cus_WSUmLCPXqyFwHnhFJ3pTx5AiV9qwDZ7n",
        "description": "Updated description",
        "due_at": 1774405313,
        "finalized_at": 1773800524,
        "billing_statement_merchant_name": null,
        "billing_statement_number": "7Z5VRJUI-0001",
        "billing_statement_url": "https://bill.payrexhq.com/b/test_bstm_nLFsNS1Yxhm2BMABpXQgqC7Qh3Uv4cGU_secret_VGK5EBp45hSbwGuEFdJWBq34Pr6ffd9uWsGHqdGxPgiwpSS4Yk",
        "line_items": [
            {
                "id": "bstm_li_pR6GgVhnLkw5vWicvKPws9gh82QrN2vS",
                "resource": "billing_statement_line_item",
                "description": "Line Item 1",
                "billing_statement_id": "bstm_nLFsNS1Yxhm2BMABpXQgqC7Qh3Uv4cGU",
                "livemode": false,
                "quantity": 1,
                "unit_price": 50000,
                "created_at": 1773800490,
                "updated_at": 1773800490
            }
        ],
        "livemode": false,
        "merchant_id": "merc_XNNXbTz2n4UAigUwdPRdPqYUk61vvBDW",
        "statement_descriptor": null,
        "status": "void",
        "metadata": null,
        "customer": {
            "id": "cus_WSUmLCPXqyFwHnhFJ3pTx5AiV9qwDZ7n",
            "name": "Test Customer",
            "email": "test@example.com"
        },
        "payment_intent": {
            "id": "pi_9D75uCazKhgUYS7BawuAGYMutiYPxS7s",
            "resource": "payment_intent",
            "amount": null,
            "amount_received": null,
            "amount_capturable": null,
            "client_secret": "pi_9D75uCazKhgUYS7BawuAGYMutiYPxS7s_secret_CYFFdLjARWV4Qo9ro1txsqdGjLNP6v9i",
            "currency": null,
            "description": null,
            "last_payment_error": null,
            "latest_payment": null,
            "livemode": false,
            "metadata": null,
            "payment_methods": null,
            "payment_method_id": null,
            "payment_method_options": null,
            "statement_descriptor": null,
            "status": "canceled",
            "next_action": null,
            "return_url": null,
            "created_at": 1773800524,
            "updated_at": 1773800535
        },
        "payment_settings": {
            "payment_methods": [
                "card"
            ]
        },
        "created_at": 1773800490,
        "updated_at": 1773800535
    },
    "livemode": false,
    "pending_webhooks": 1,
    "previous_attributes": {
        "status": "open"
    },
    "created_at": 1773800535,
    "updated_at": 1773800535
}
